#### Importing packages:

In [1]:
import pandas as pd
import numpy as nm
from sklearn import linear_model as lm

#### Importing the dataset:

In [2]:
df = pd.read_csv('/Users/akshay/Desktop/python/py-master/ML/2_linear_reg_multivariate/Exercise/hiring.csv')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

#### Data preprocessing & cleaning:

In [3]:
# checking for na values
df.isna().sum()

experience                    2
test_score(out of 10)         1
interview_score(out of 10)    0
salary($)                     0
dtype: int64

In [4]:
# cleaning the numerical fields
df.experience.fillna(0, inplace = True)
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          0                    8.0                           9      50000
1          0                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
df.replace({
    'five': 5,
    'two': 2,
    'seven': 7,
    'three': 3,
    'ten': 10,
    'eleven': 11
}, inplace = True)

df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [6]:
import math
median_test_score = math.floor(df['test_score(out of 10)'].median())

In [7]:
df['test_score(out of 10)'].fillna(median_test_score, inplace = True)
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

### Training the model:
#### Formula: y = m1x + m2x + m3x + C

In [8]:
reg = lm.LinearRegression()

reg.fit(df[['experience','test_score(out of 10)','interview_score(out of 10)']], df['salary($)'])

LinearRegression()

#### Indentifying the Coefficient:

In [9]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

#### Identifying the Intercept:

In [10]:
reg.intercept_

17737.26346433768

#### Prediction:

In [11]:
print('Salary of an employee with 2 years experience with test score of 5 and interview score of 6 salary is', 
      reg.predict([[2,5,6]]))

Salary of an employee with 2 years experience with test score of 5 and interview score of 6 salary is [45823.1441048]

In [12]:
print('Salary of an employee with 12 years experience with test score of 10 and interview score of 10 salary is', 
      reg.predict([[12,10,10]]))

Salary of an employee with 12 years experience with test score of 10 and interview score of 10 salary is [92002.18340611]